In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('BillsJan.csv', decimal=',')

In [3]:
df.head()

,date,bill_number,total,paid_cash,paid_card,paid_customer_card,user
0,01.01.2018,34634,21.27,NaN,21.27,NaN,Anna
1,01.01.2018,34845,105.56,105.56,NaN,NaN,Anna
2,01.01.2018,35015,5.20,NaN,NaN,5.2,Alex
3,01.01.2018,35115,26.28,NaN,26.28,NaN,Alex
4,01.01.2018,35125,95.26,95.26,NaN,NaN,Alex

In [8]:
total_for_anna = df.groupby('user')['total'].sum()

In [9]:
total_for_anna

user
Alex     36132.55
Anna      6788.61
Marie    16401.59
Name: total, dtype: float64